//
//  FirstTableViewController.swift
//  Cares
//
//  Created by DE DPU on 5/10/2559 BE.
//  Copyright © 2559 MyApplication. All rights reserved.
//

import UIKit

class FirstTableViewController: UITableViewController {

    var FirstTableArray = [String]()
    var SecondArray = [SecondTable]()
    var ThirdArray = [ThirdView]()
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        
        FirstTableArray = ["ศีรษะ", "ลำตัวส่วนบน", "ลำตัวส่วนล่าง", "ทั่วไป"]
        
        SecondArray =
            [SecondTable(SecondTitle: ["สมองอักเสบ", "เนื้องอกในสมอง", "ปวดศีรษะจากความเครียด"]),
            SecondTable(SecondTitle: ["มะเร็งตับ", "ปอดอักเสบ"]),
                SecondTable(SecondTitle: ["กระเพาะปัสสาวะอักเสบ", "ข้อเสื่อม"]),
                SecondTable(SecondTitle: ["ไข้เลือดออก"])]
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         
        ThirdArray = [ThirdView(ThirdViewArray: ["สมองอักเสบ (Encephalitis)\r\n\r\nเป็นโรคที่พบได้ทั้งในเด็กและผู้ใหญ่ สาเหตุเกิดจากเชื้อไวรัส ซึ่งมีอยู่หลายชนิดที่พบบ่อยคือ B Virus ซึ่งปกติอาศัยอยู่ในสัตว์เลี้ยง เช่น หมู แพะ ม้า เป็นต้น ติดต่อถึงคนนโดยยุงรำคาญ(culex)\r\n\r\nอาการ\r\n\r\nมีใช้สูงอย่างเฉียบพลัน ปวดศีรษะ อ่อนเพลีย คลื่นไส้ อาเจียน ผู้ป่วยอาจจะซึมลงเรื่อยๆ จนไม่รู้สึกตัว อาจมีอาการชักร่วมด้วย\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nไข้สูง ซึม หรือหมดสติ deep tender refax ไวกว่าปกติ อาจมีมือสั่น หรืออาการอัมพาตของแขนและขา\r\n\r\nการรักษา\r\n\r\nหากสงสัย ให้รีบส่งแพทย์ ซึ่งอาจจะวินิจฉัยโรคโดยการเจาะหลัง(lumbar puncture) เพื่อตรวจน้ำไขสันหลัง และอาจจะต้องตรวจคลื่นสมองต่อไป", "เนื้องอกในสมอง (Brain tumor)\r\n\r\nเนื้องอกในสมอง เป็นโรคที่พบได้ไม่บ่อยนัก พบได้ทั้งในเด็กและผู้ใหญ่ เนื้องอกในสมองที่พบได้ในเด็กมักเป็นเนื้องอกที่เกิดขึ้นเองภายในกระโหลกศีรษะ ส่วนในผู้ใหญ่มักเกิดจากการแพร่กระจายมาจากที่อื่น เช่น ปอด เต้านม กระเพาะลำไส้ เป็นต้น\r\n\r\nอาการ\r\n\r\nอาการศีรษะเกิดจากการที่มีเนื้องอกภายในกระโหลก อาจมีอาการเกิดขึ้นเป็นครั้งคราว มีความรุนแรงปานกลางในระยะแรกๆ และปวดข้างใด ข้างหนึ่งของศีรษะ มักเป็นข้างเดียวกับด้านที่มีเนื้องอกอยู่ มักปวดลึกๆ หรือปวดตุบๆ ก็ได้ ส่วนมากอาการจะรุนแรงในตอนเช้าๆ พอสายๆ จะทุเลาลง และจะปวดมากขึ้นขณะก้ม ไอ จาม เบ่งอุจจาระ หรือปัสสาวะ บางครั้งอาจมีอาเจียนพุ่ง ซึม เพ้อ คลั่ง ชัก แขนขาอ่อนแรง เดินเซ ตาเห็นภาพซ้อนหรือตาพร่ามัวลงเรื่อยๆ ซึ่งบางครั้งอาการเหล่านี้อาจเกิดในระยะเวลาสั้นๆ\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nอาจตรวจพบความผิดปกติของ neurologic sings การตรวจ fundi จะพบ papilledema ซึ่งช่วยในการวินิจฉัยโรคอย่างมาก\r\n\r\nการรักษา\r\n\r\nหากสงสัย ให้รีบส่งแพทย์", "ปวดศีรษะจากความเครียด (Tension headache)\r\n\r\nปวดศีระจากความเครียด เป็นอาการปวดศีรษะที่พบได้บ่อย ผู้ป่วยปวดศีรษะประมาณร้อยละ 80-90 มีสาเหตุมาจากความเครียดต่างๆ เช่น นอนไม่หลับ เครียดทำงาน หนักใช้สมองมาก เป็นต้น\r\n\r\nอาการ\r\n\r\nผู้ป่วยจะมีอาการปวดตึงกล้ามเนื้อบริเวณต้นคอรอบๆ ศีรษะ ลักษณะการปวดจะคล้ายๆ กับกล้ามเนื้อถูกบีบรัด บางคนอาจมีอาการปวดตื้อไปที่ส่วนบนของศีรษะบริเวณขมับ ใบหน้าและหน้าผาก อาการปวดเกิดขึ้นช้าๆ โดยจะไม่มีอาการนำมาก่อน ส่วนใหญ่อาการมักเป็นอยู่เพียงไม่กี่ชั่วโมงก็จะทุเลาไปเอง อาการไม่รุนแรงมากนัก แต่อาจจะทวีความรุนแรงขึ้นและจะเป็นอยู่ในระยะเวลานานๆ เป้นวัน สัปดาห์ หรือเป็นเดือน อาการปวดนี้จะไม่สามารถระงับได้ด้วยยากลุ่ม ergotamine แต่สามารถจะลดลงได้โดยยาแก้ปวด ยากล่อมประสาท ยานอนหลับหรือยาที่ทำให้กล้ามเนื้อคลายตัว\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nจะไม่มีสิ่งผิดปกติใด ความดันโลหิตอยู่ในเกณฑ์ปกติ\r\n\r\nการรักษา\r\n\r\n1. ให้ผู้ป่วยนอนหลับสักพักหนึ่งหรือนวดบริเวณต้นคอและขมับ อาการจะดีขึ้น\r\n2. ถ้าอาการไม่ดีขึ้น ให้ยาแก้ปวด Paracetamol 500 มก. ครั้งละ 1-2 เม็ด ซ้ำได้ทุก 4-6 ชั่วโมง ในกรณีจากความเครียด นอนไม่หลับ ให้ยากล่อมประสาท\r\n3. ถ้าอาการปวดรุนแรงปวดติดต่อกันนานเกิน 24 ชั่วโมง อาการปวดถี่ หรือปวดรุนแรงขึ้น แนะนำให้ไปพบแพทย์ เพื่อให้การวินิจฉัยและรักษาต่อไป"]),//user \r\n in new line
            ThirdView(ThirdViewArray: ["มะเร็งตับ\r\n\r\nเป็นโรคมะเร็งที่พบได้บ่อยในผู้ชายมากกว่าผู้หญิงประมาณ 4-5 เท่า ซึ่งอาจจะแบ่งออกเป็น 2 ชนิด \r\n1.มะเร็งของเซลล์ตับ (Hepatoma /hepatocallular carcinma)เชื่อว่ามีสาเหตุสัมพันธ์กับโรคตับอักเสบ ไวรัสบี และตับแข็ง และยังพบว่าสาวaflatoxin จากเชื้อรา ที่ขึ้นบนถั่วลิสง ข้าวโพด หัวหอม กระเทียม เป็นสาเหตุสำคัญของมะเร็งชนิดนี้ด้วย\r\n2. มะเร็งของเซลล์ท่อน้ำดี (Cholangiocarcinoma)เชื่อว่ามีสาเหตุสัมพันธ์กันโรคพยาธิใบไม้ในตับ และสาร nitrosamine เป็นสารพิษที่พบในอาหารพวกโปรตีนหมัก และอาหารเนื้อสัตว์ที่ผสมดินประสิว เช่นปลาร้า ปลาสับ หมูสับ แหนม กุนเชียง ไส้กรอก เป็นต้น\r\n\r\nอาการ\r\n\r\nมีไข้ต่ำ ๆ อ่อนเพลีย เบื่ออาหาร ท้องอืดเฟ้อคล้ายอาหารไม่ย่อย ต่อมาจะผอม ลงอย่างรวดเร็ว ในระยะหลัง ๆ ผู้ป่วยมีอาการเจ็บใต้ชายโครงขวา มีตัวเหลือง ตาเหลือง ท้องมานน้ำ และอาจมีม้ามโต อาเจียนหรือถ่ายเป็นเลือด\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nไข้ ดีซ่าน ตับโต และมีอาการกดเจ็บบริเวณใต้ชายโครงขวา และอาจคลำได้ก้อนแข็งขุระที่บริเวณใต้ชายโครงขวา\r\n\r\nการรักษา\r\n\r\n1. ถ้าสงสัยให้รีบส่งแพทย์ เพื่อการตรวจอุจจาระ ตรวจเลือด หรืออาจทำ liver scan","ปอดอักเสบ (Pneumonia)\r\n\r\nเป็นโรคทางเดินหายใจที่รุนแรงโรคหนึ่ง มักพบในคนที่ไม่แข็งแร็งหรือมีภูมิต้านทานต่ำ หรือจากภาวะแทรกซ้อนของโรคอื่น สาเหตุเกิดจากเชื้อราหรือสารเคมีที่สำคัญที่สุดได้แก่ เชื้อpneumococcus ซึ่งพบได้บ่อย ส่วนเชื้อ staphy lococcus,streptococcus หรือ klebsiella พบได้น้อย แต่ผู้ป่วยจะมีอาการที่รุนแรง นอกจากนั้นอาจเกิดจากเชื่อ Mycoplasma เชื้อไวรัส เชื้อรา หรือสารเคมี\r\n\r\nอาการ\r\n\r\nมีไข้สูงเกิดขึ้นทันทีทันใด มีอาการหนาวสั่น หายใจหอบ ระยะแรกอาจมีอาการไอแห้ง ๆ ไม่มีเสมหะ ต่อมาอาจมีเสลตสีเหลืองเขียว หรือสีสนิมเหล็กหรือมีเลือดปน มีอาการเจ็บหน้าอก เวลาไอหรือหายใจเข้าแรง ๆ\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nไข้สูง 39-40 องศาเซลเซียส ลิ้นอาจเป็นผ้า การขยายตัวของทรวงอกน้อยเคาะได้ยินเสียงทึบ (dullness )ฟังปอดอาจมีเสียงหายใจค่อย (diminished breath sound) หรือมีเสียงcrepitation\r\n\r\nการรักษา\r\n\r\n1. ในรายที่เริ่มเป็นไม่มีอาการหอบ ให้ผู้ป่วยพักผ่อนให้ดื่มน้ำมาก ๆ ใช้ผ้าชุบน้ำเช็ดตัวเวลามีไข้\r\n2. ให้ยาเม็ดลดไข้ Paracetamol\r\n3. ถ้ามีอาการไม่ดีภายใน 3 วัน ให้รีบส่งพบแพทย์"]),
            ThirdView(ThirdViewArray: ["กระเพาะปัสสสาวะอักเสบ (Cystitis)\r\n\r\nกระเพาะปัสสสาวะอักเสบ (Cystitis) พบได้บ่อยในผู้หญิง ตั้งแต่เด็กจนถึงผู้ใหญ่ โดยเฉพาะในผู้หญิงตั้งครรภ์ ในช่วง 2-3 เดือนแรก สาเหตุอาจเกิดจากการติดเชื้อแบคทีเรียที่อยู่บริเวณทวารหนัก เข้าไปทางท่อปัสสาวะ หรืออาจเกิดจากภาวะแทรกซ้อนจากนิ่วใน กระเพาะปัสสาวะ ต่อมลูกหมากโต ผู้ป่วยที่ได้รับการสวนปัสสาวะ หรือผู้ป่วยโรคเบาหวาน\r\n\r\nอาการ\r\n\r\nอาจมีไข้ ปัสสาวะกระปริดกระปรอย รู้สึกปวดขัด หรือแสบร้อนเวลาถ่ายปัสสาวะ อาจมีการปวดที่ท้องน้อย ปัสสาวะอาจมี กลิ่นเหม็น ขุ่นหรือ มีเลือดปน ในเด็กอาจมีปัสสาวะรดที่นอน เบื่ออาหารอาเจียน\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nในกรณีเป็นเฉียบพลัน จะมีใข้ ปวดบริเวณท้องน้อย \r\n\r\nการรักษา\r\n\r\n1. ให้ดื่มน้ำมาก ๆ วันละ 3-4 ลิตร\r\n2. ให้ยาแก้ปวดลดไข้ paracetamol 500 มก.คร้งละ 1-2 เม็ด ทุก 4-6 ชั่วโมง\r\n3. ให้ยาปฏิชีวนะ co-trimoxazole 400 มก.ครั้งละ 2 เม็ดวันละ 2 ครั้ง เป็นเวลา 10 วัน ampicillin 250 มก. ครั้งละ 2 แคปซูล วันละ 4 ครั้ง เป็นเวลา 5 วัน\r\n4. ถ้าอาการไม่ดีขึ้น หรือเป็นซ้ำกันหลาย ๆ ครั้ง ควรส่งพบแพทย์เพื่อตรวจปัสสาวะ นำปัสสาวะไปเพาะเชื้อ x-ray หรืออาจต้อง ส่องกล้องตรวจระบบทางเดินปัสสาวะ (cystoscope)","ข้อเสื่อม (Osteoarthritis)\r\n\r\nเป็นโรคที่พบบ่อยที่สุด พบมากในหญิงทีอายุ 50 ปีขึ้นไปและมีรูปร่างอ้วน เกิดจากการเลื่องของข้อที่ต้องทำงานหนักมาก เช่น ข้อเข่า ข้อกระดูกสันหลัง ระดับเอว และระดับคอ ข้อเท้า ข้อตะโพก ข้อเล็ก ๆ ของมือ และเท้า โดยเฉพาะ distal interphalangeal joints\r\nสาเหตุจากการเลื่อมของข้อจะเกิดขึ้น โดยกระดูกอ่อนภายในข้อถูกแรงกระแทก หรือเสียดสี จนมีลักษณะขุระ เปื่อยยุ่ยและบางลง ร่างกายขะพยายามซ่อมแซมส่วนที่สึกหรอ โดยการสร้างเซลล์กระดูกอ่อนเพิ่มขึ้น มีหินปูนเข้าไปพอกทำให้ผิวกระดูหขรุขระ ช่องระหว่างข้อต่อแคบลง เมื่อเวลาเคลื่อนไหวกระดูกจะเสียดสีกันมีเสียงดังกรุบกรับ และเกิดการเสียดสีต่อเยื่อหุ้มข้อและพังผืด ทำให้เกิดการเจ็บปวดมีอาการอักเสบเฉียบพลัน เป็นบางครั้งบางคราว ร่วมกับมีการอักเสบเรื้อรัง\r\n\r\nอาการ\r\n\r\nปวดขัดในข้อ มักเกิดเวลาเปลี่ยนท่านั้ง เป็นท่ายืน เดินไกล ๆ หรือขึ้นบันใดหรือยกของหนัก\r\n\r\nสิ่งตรวจพบ\r\n\r\nเมื่อจับข้อข้างที่ปวดโยกไปมา มักจะได้ยินเสียงดังกร็อบแกร็บ การตรวจภาพรังสีของข้อ มักจะพบว่าช่องว่างระหว่างกระดูกแข็งแคบลง ขอบกระดูกแข็งมีติ่งกระดูกย้นออกไป การเปลี่ยนแปลงที่เห็นจะมีมากน้อย แล้วแต่กาลเวลา\r\n\r\nการรักษา\r\n\r\n1. ในกรณีปวดข้อรุนแรงหรือเป็นชนิดเฉียบพลัน ให้ยาแก้ปวด Aspirin 350 มก. ครั้งละ 3-4 เม็ด วันละ 3-4 ครั้ง\r\n2. คนอ้วนหรือมีน้ำหนักเกิดควรพยายามลดน้ำหนัก ให้นั่งเก้าอี้แทนการนั่ง ยอง ๆ หรือนั้งพับเพียบลงกับพื้น\r\n3. ต้องบริหารและฝึกฝนกล้ามเนื้อบริเวณข้อที่ปวดให้แข็งแร็งขึ้น โดยเกร็งกล้ามเนื้อประมาณ 5-10 นาที พัก ทำซ้ำ 10 ครั้ง วันละ4-5 ครั้ง นอกจากการรักษาอาการปวดข้อได้แล้ว ยังสามารถป้องกันให้โรคปวดข้อกำเริบได้อีก\r\n4. หลีกเลี่ยงการใช้ยาทา ถูก หรือ กัด เพราะจะทำให้เกิดการอักเสบ ขึ้นได้ง่าย\r\n5. ถ้าอาการไม่ดีขึ้น แนะนำให้พบแพทย์เพื่อทำการวินิจฉัยโรคและรักษาต่อไป"]),
            ThirdView(ThirdViewArray: ["ไข้เลือดออก (Hemorrhagic fever)\r\n\r\nเป็นโรคที่พบบ่อยในเด็กอายุ 2-10 ปี สาเหตุจากเชื้อไวรัส Dengue กับ Chigunkunya ซึ่งส่วนใหญ่และจะเกิดจากเชื้อ Dengue โดยมียุงลาย Aedes aegyti เป็นพาหะนำโรค\r\n\r\nอาการ\r\n\r\nอาการของโรคไข้เลือดออกจะแบ่งออกเป็น 3 ระยะ ดังนี้\r\nระยะไข้สูง ผู้ป่วยจะมีไข้สูงอย่างเฉียบพลัน ซึม หน้าตาแดง ปวดศรีษะ กระหายน้ำ มักมีอาการเบื่ออาหาร และอาเจียนร่วมด้วยเสมอ บางคนอาจปวดท้องบริเวณใต้ลิ้นปี่ หรือ ชายโครงขวา อาจมีอาการท้องผูกหรือถ่ายเหลว ประมาณวันที่ 3 ของไข้อาจมีผื่นแดงขึ้นตามแขนขาและลำตัว ไม่คัน บางคนอาจมีจุดเลือดออก มีลักษณะเป็นจุดแดงเล็ก ๆ หรืออาจเป็นจ้ำเขียวขึ้นตาม ใบหน้า แขน ขา ซอกรักแร้ ใน ระยะไข้สูงนี้จะใช้เวลาประมาณ 4-7 วัน\r\nระยะเลือดออกและช็อก จะเกิดในช่วงระหว่างวันที่ 3-7 อาการไข้จะเริ่มลดลง แต่กลับมีอาการปวดท้องและอาเจียนบ่อยขึ้น อาจอาเจียนเป็นเลือด เลือดกำเดาไหล ซึมมากขึ้น กระสับกระส่าย ตัวเย็น มือเท้าเย็นเหงื่อออกมาก ปัสสาวะน้อย มักเกิดภาวะช็อกตามมา ระยะนี้จะใช้เวลา 24-72 ชั่วโมง\r\nระยะฟื้นตัว ถ้าผู้ป่วยผ่านภาวะช็อก หรือผ่านภาวะวิกฤตแล้วก็จะฟื้นตัวสูสภาวะปกติรวมระยะเวลาตั้งแต่เริ่มต้นเป็นจะไม่เกิน 10 วัน\r\n\r\nสิ่งที่ตรวจพบ\r\n\r\nในระยะไข้สูง (39-40 องศาเซลเซียส )จะไม่ค่อยมีอาการไอหรือน้ำมูกไหล อาจตรวจพบจุดแดงขึ้นตามแขน หน้า ขา ในเพดานปาก กระพุ้งแก้ม หรือลิ้นไก่ มีคอแดงบ้างเล็กน้อย อาจมีอาการกดเจ็บบริเวณท้องใต้ลิ้นปี่หรือใต้ชายโครงด้านขวา คลำพบตับโต ในระยะนี้การทดสอบ Toueniquet ส่วนใหญ่จะให้ผลบวก ตั้งแต่วันที่ 2 ของไข้ โดยมีจุดเลือดออกมากกว่า 10 จุด ในวงกลมเส้นผ่านศูนย์กลาง 1 นิ้ว ในระยะเลือดออกและช็อก พบผู้ป่วยกระสับกระส่าย ปากเขียว ตัวเย็น เหงื่อออกมาก ชีพจรเต้นเร็ว ความดันโลหิดต่ำ จนบางครั้งอาจจะวัดไม่ได้\r\n\r\nการรักษา\r\n\r\n1. ถ้าอาการไม่รุนแรง ให้ผู้ป่วยพักผ่อนให้มาก ๆ ใช้ผ้าชุบน้ำเช็ดตัวบ่อย ๆ ให้อาหารอ่อน และให้ดื่มน้ำมาก ๆ\r\n2. ให้ยาลดไข้ Paracetamol ทุก 4-6 ชั่วโมง (ห้ามใช้ Aspirin เพราะอาจทำให้เลือดออกได้ง่าย )\r\n3. ถ้าผู้ป่วยมีภาวะช็อกหรือเลือดให้รีบส่งแพทย์ โดยด่วน"])]
        
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    
    override func tableView(tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return FirstTableArray.count
    }

    override func tableView(tableView: UITableView, cellForRowAtIndexPath indexPath: NSIndexPath) -> UITableViewCell {
        var Cell = self.tableView.dequeueReusableCellWithIdentifier("Cell", forIndexPath: indexPath) as UITableViewCell
        
        Cell.textLabel?.text = FirstTableArray[indexPath.row]
        
        return Cell
    }
    
    override func prepareForSegue(segue: UIStoryboardSegue, sender: AnyObject?) {
        
        var indexPath : NSIndexPath = self.tableView.indexPathForSelectedRow!
        var DestViewController = segue.destinationViewController as! SecondTableViewController
        var SecondTableArrayTwo : SecondTable
        var ThirdAnswerArray : ThirdView
        
        SecondTableArrayTwo = SecondArray[indexPath.row]
        DestViewController.SecondArray = SecondTableArrayTwo.SecondTitle
        
        ThirdAnswerArray = ThirdArray[indexPath.row]
        DestViewController.SecondAnswerArray = ThirdAnswerArray.ThirdViewArray
        
        
        
    }
    
    /*func colorForIndex(index: Int) -> UIColor {
        let itemCount = FirstTableArray.count - 1
        let color = (CGFloat(index) / CGFloat(itemCount)) * 0.6
        return UIColor(red: 1.0, green: color, blue: 0.0, alpha: 1.0)
    }
    
    override func tableView(tableView: UITableView, willDisplayCell cell: UITableViewCell,
                            forRowAtIndexPath indexPath: NSIndexPath) {
        cell.backgroundColor = colorForIndex(indexPath.row)
    }*/
    
}
